//===================================================
//
// オブジェクトの抽象クラス [object.cpp]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// インクルードファイル
//***************************************************
#include "ObjectBase/object.h"
#include "Manager/object_manager.h"

//===================================================
// コンストラクタ
//===================================================
CObject::CObject(const int nPriority) :
	m_nPriority(nPriority),
	m_bDeath(false)
{
	// ゲームオブジェクトの登録
	CObjectManager::Register(this, nPriority);
}

//===================================================
// デストラクタ
//===================================================
CObject::~CObject()
{
}

//===================================================
// 自分の死亡フラグを立てる
//===================================================
void CObject::Release(void)
{
	m_bDeath = true;
}