//===================================================
//
// メッシュの共通パラメータ [mesh_param.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#pragma once

//***************************************************
// インクルードファイル
//***************************************************
#include "Buffer/vertex_buffer.h"
#include "Buffer/index_buffer.h"

//***************************************************
// メッシュの共通パラメータの宣言
//***************************************************
struct MeshParam
{
	CVertexBuffer vertexBuffer;				// 頂点バッファ
	CIndexBuffer indexBuffer;				// インデックスバッファ
	VECTOR2INT segment	= VECTOR2INT(1,1);	// 分割数
	D3DXCOLOR col		= Const::WHITE;		// 色
	int nNumVertex		= 0;				// 頂点の総数
	int nNumPolygon		= 0;				// ポリゴンの総数
	int nNumIndex		= 0;				// インデックス総数
	int nTextureID		= -1;				// テクスチャのID
};