//===================================================
//
// キャラクター [character.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#pragma once

//***************************************************
// インクルードファイル
//***************************************************

//***************************************************
// 前方宣言
//***************************************************
class CModel;	// モデルクラス
class CMotion;	// モーションクラス

//***************************************************
// キャラクタークラスの定義
//***************************************************
class CCharacter3D
{
public:
	CCharacter3D(const char* pMotionFilePath);
	~CCharacter3D();

	void Update(void);
	void Draw(void);

	/// <summary>
	/// モーションクラスの取得
	/// </summary>
	/// <returns>モーションクラスへのポインタ</returns>
	inline CMotion* GetMotion(void) { return m_pMotion.get(); }
private:
	std::vector<std::unique_ptr<CModel>> m_vpModel;	// モデル
	std::unique_ptr<CMotion> m_pMotion;				// モーションクラス
};