//===================================================
//
// ワールド情報 [transform_data.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#pragma once

//***************************************************
// インクルードファイル
//***************************************************

//***************************************************
// 2Dワールド情報
//***************************************************
struct Transform2D
{
	D3DXVECTOR3 pos		= Const::VEC3_NULL;		// 位置
	D3DXVECTOR3 size	= Const::VEC3_NULL;		// 大きさ
	float fAngle		= 0.0f;					// 角度
};

//***************************************************
// 3Dワールド情報
//***************************************************
struct Transform3D
{
	D3DXVECTOR3 pos				= Const::VEC3_NULL;				// 位置
	D3DXQUATERNION quaternion	= Const::QUATERNION_IDENTITY;	// クォータニオン
	D3DXVECTOR3 scale			= Const::INIT_SCAL;				// 大きさ
	D3DXMATRIX mtxRotation		= Const::MTX_IDENTITY;			// 回転行列だけ抽出したい時用の変数
	D3DXMATRIX mtxWorld			= Const::MTX_IDENTITY;			// マトリックス
};